window.lzxStories = [
  {
    key: "poorChildhood",
    period: "贫苦童年",
    stories: [
      {
        key: 'poorChildhood1',
        locationKey: ['fuJianFuZhou'],
        location: '福建福州',
        time: '1785年8月30日',
        detail: `林则徐的父亲林宾日，是私塾先生，林则徐母亲叫陈帙，林宾日陈帙夫妇一共生育十一名子女，林则徐是次子。
林家人口众多，比较贫苦，家计虽不用代劳，但林则徐每天到书塾之前，都会先为母亲姊妹的工艺品拿到店铺寄卖，放学后，则再到店铺收钱交回母亲。贫苦的童年和严格的家教，使他日后升至高官时都保持
清俭的习惯和察民疾苦的作风。
林则徐童年家境寒苦，但他得到开明的父亲教导，还有一个温馨的家庭，童年是非常快乐的。邻居常常听到林家吃饭时的欢笑声，探看之下，不过是十多个人津津有味吃着豆腐。后来林家以此事来教诲子孙知
足常乐的道理。
`}
    ]
  },
  {
    key: "youthEnlightenment",
    period: "少年启蒙",
    stories: [
      {
        key: 'youthEnlightenment1',
        time: '1789年',
        locationKey: ['fuJianFuZhou'],
        location: '福建福州',
        detail: `尽管林则徐家境寒苦，但是林宾日非常重视教育。四岁时，父亲林宾日已将他携入塾中，教以晓字。七岁，已经熟练文体。他八九岁时，就在学堂上写出了“海到无涯天作岸，山登绝顶我为峰”的诗 
句，震惊四座，他在书塾常常以佳作得到奖金。林则徐十二岁时，孔庙召童生任佾生，经一轮选拔之后，林则徐当选任佾生，为祭祀乐舞的人员。林则徐还在福建当时的最高学府鳌峰书院专心向学，写有读书
札记《云左山房杂录》，将诸子百家一同采纳。
入读期间，林则徐通过父亲结识汉学家陈寿祺。陈寿祺为人愤世嫉俗，对现实的社会问题和官场有深刻的思考。他经世匡时之思想对林则徐有潜移默化作用。与他同时入读的还有郑光策女婿梁章巨。两人少时
已经交往甚频，加上梁章巨早已接受郑光策“经世致用”之学，加深林则徐“经世致用”之思想，两人同时立下“经国救世”之志。
`
      }
    ]
  },
  {
    key: "zhongjuMarried",
    period: "中举成家",
    stories: [
      {
        key: 'zhongjuMarried1',
        locationKey: ['fuJianFuZhou'],
        location: '福建福州',
        time: '1804年',
        detail: `林则徐参加乡试，中第二十九名举人。就在揭晓成绩排名的那一天，他正式迎娶郑淑卿为妻，以当时来说，进士门第出身的郑家千金嫁给家境寒苦的林家秀才，是件罕见的事情。自此林则徐在郑淑 
卿在世时都没有纳过妾侍，终其一生情深不渝。林则徐逝世后，同治至光绪年间，英国的杜莎夫人蜡像馆特地为林则徐郑淑卿夫妇制作蜡像，成为少数可长期展出的名人蜡像，以表敬意。
年底，新婚燕尔的林则徐离开家人前往京师参加会试，但名落孙山。回乡后就在福州北库巷开设“补梅书屋”开班授徒，等待下一次的会试。
`}
    ]
  },
  {
    key: "newCareer",
    period: "初任仕途",
    stories: [
      {
        key: 'newCareer1',
        location: '福建厦门',
        locationKey: ["fuJianXiaMen"],
        time: '1806年',
        detail: `林则徐担任厦门海防同知书记，专责处理商贩洋船来往、米粮兵饷的文书记录。那时厦门的走私鸦片问题严重，历任厦门海防同知皆是贪官污吏，外商贿赂成风，无人打击走私。林则徐认识到鸦片 
问题、烟贩伎俩。任内他得到汀漳龙道百龄和福建巡抚张师诚赏识，张师诚招他成自己的幕僚。`
      },
      {
        key: 'newCareer2',
        location: '福建厦门',
        locationKey: ["fuJianXiaMen"],
        time: '1809年9月',
        detail: `张师诚位极人臣，对典章大政等政治学问均有所知，他将自己公事上的知识、权术一一传授给林则徐，甚至他在嘉庆十四年八月（1809年9月），镇压海盗蔡牵时亦一同随往，令林则徐间接参与镇压
。张师诚事后称赞林则徐：“是役也，僚属睹余督剿之劳，佥谓非余先得贼踪，飞檄催战，未必能如斯神速。”
同年年底，张师诚推荐林则徐父亲林宾日为乐正书院主持，林家经济得以改观。后林则徐又在这年参加燕京会试，可惜仍是落第，他依然留在张师诚幕府当幕僚。`
      },
      {
        key: 'newCareer3',
        location: '北京',
        locationKey: ["beiJing"],
        time: '1811年',
        detail: `26岁的林则徐赴京会考，殿试高居第二甲第四名，选为庶吉士，授翰林编修，从此踏上了官宦之途。`
      }
    ]
  },
  {
    key: "renShuJiShi",
    period: "任庶吉士",
    stories: [
      {
        key: 'renShuJiShi1',
        location: '北京',
        locationKey: ["beiJing"],
        time: '1813年',
        detail: `嘉庆十八年五月初九（1813年），林则徐入翰林院庶常馆任庶吉士。同年九月初七（1813年9月30日），天理教起事，教徒直攻打至京师，林则徐亲睹事态，他后来作书《强忠烈公遗墨后》，纪念当
        时被教徒处死的滑县知县强克捷。林则徐在翰林院度过七年岁月，被派往不同地方工作，但仍是微不足道的小京官。七年期间，他的子女相继出世。单较二百两银年俸，根本不足以应付家庭开支。唯有间中在
        书塾教书，或寄卖自己的书法作品帮补家用。在翰林院期间，他著经济专书《北直水利书》。
        林则徐虽不善社交，但他于嘉庆十九年加入了由地位不高的京官组成的宣南诗社，结交黄爵滋、龚自珍、魏源等人，林则徐成为他们的领袖。`
      }
    ]
  },
  {
    key: "fenErBaGuan",
    period: "愤而罢官",
    stories: [
      {
        key: 'fenErBaGuan1',
        location: '河南',
        locationKey: ["heNan"],
        time: '1821年',
        detail: `嘉庆二十五年（1820年）二月，林则徐任江南道监察御史，河南南岸河堤缺口，河南巡抚琦善办事不力，引发大水灾，林则徐不惧琦善满洲贵族的背景，向嘉庆帝直奏琦善的无能。他为官清廉，不 
        畏权势，行事果敢，不假情面，导致同僚的猜忌、冷嘲热讽，林则徐因此对官场厌倦。道光元年（1821年），林宾日病危，林则徐以照顾父亲为由辞官而去。乘船返回家乡期间，妻子郑淑卿在船上诞下三女林
        普晴，返回福州时，林宾日已病愈。`
      }
    ]
  },
  {
    key: "fuZhiGuanChang",
    period: "复职官场",
    stories: [
      {
        key: 'fuZhiGuanChang1',
        time: '1823年2月',
        location: '江苏',
        locationKey: ["jiangSu"],
        detail: `林宾日陈帙夫妇及家乡的乡亲父老极为反对林则徐辞官的决定，而且在家乡也不知用什么技能求生，唯有不情不愿地再涉官场。他的主师曹振镛、房师沈维鐈一直为林则徐斡旋，道光帝亦知林则徐 
        任内的政绩卓越，特地召见夸赏他，并破格复林则徐职。自此，深受道光帝宠重的林则徐青云直上，终可以一展抱负。道光三年正月初七（1823年2月17日），林则徐任江苏按察使，在任期间澄清江苏吏治， 
        改革审判程序，亲自裁决案件。甚至黑夜潜行，明查暗访，验尸时亦亲自动手。短短在任四个月内，就把江苏的积压案件处理十之八九，被江苏人民称颂为“林青天”。他并认为江苏之风气败怀，全因鸦片害人
        ，于是下令江苏禁烟。
        同年夏季，江苏大水灾，社会动荡不安，人民聚集，将成民变，官府照样追税。江苏巡抚韩文琦力主用兵镇压，林则徐极力反对，他乘船前往灾变地区，赈济灾民，平息民愤，恢复社会秩序。 `
      },
      {
        key: 'fuZhiGuanChang2',
        time: '1827年6月',
        location: '陕西',
        locationKey: ["shanXi"],
        detail: `任陕西按察使、代理布政使，在任一月即调任江宁布政使。等待交接期间，陕南略阳一带发生水灾，遂留陕暂理原职，赴略阳察看灾情，安置受灾百姓，同时还参与了县城移建事宜。 `
      },
      {
        key: 'fuZhiGuanChang3',
        time: '1830年',
        location: '湖北、河南、江苏',
        locationKey: ["heNan", "jiangSu", "heBei"],
        detail: `道光十年（1830年）秋任湖北布政使，翌年春调任河南布政使，擢东河河道总督。从六月到次年七月，林则徐先后任湖北、河南、江宁布政使。面对关系到河道民生重大问题，决心“破除情面”，“力
        振因循”，以求“弊除帑节，工固澜安”。为了治理黄河，亲自顶着寒风，步行几百里，对备用的几千个治水商梁秸进行检查，还查看沿河地势、水流情况。`
      },
      {
        key: 'fuZhiGuanChang4',
        time: '1832年2月',
        location: '江苏',
        locationKey: ["jiangSu"],
        detail: `调任江苏巡抚。从这一年起到十六年间，他对农业、漕务、水利、救灾、吏治各方面都做出过成绩，尤重提倡新的农耕技术，推广新农具。他在实践活动中认识到：“地力必资人力，土功皆属农功。
        水道多一分之疏通，即田畴多一分之利赖。”林则徐这种农耕思想，是在实际考察中体验出来的。`
      }
    ]
  },
  {
    key: "jinZhiYaPian",
    period: "禁止鸦片",
    stories: [
      {
        key: 'jinZhiYaPian1',
        time: '1839年3月',
        location: '广东',
        locationKey: ["guangDong"],
        detail: `林则徐正式抵粤，受九响礼炮之礼，所有广东高官员皆来迎接。美国商人威廉·亨德也在附近观礼，他留下了有关林则徐相貌的重要文献:"气度庄重，表情相当严厉，身材肥胖，上唇浓密的黑短髭，
        下巴留着长髯，看来六十岁左右。" 林则徐首先参观越华书院，并题了一对对联:"海纳百川，有容乃大 壁立千仞，无欲则刚"。众鸦片烟商以为贿赂就能打动新来的钦差大臣，偏是林则徐就与历来的官员不同
        ，视钱财如无物，他限定所有烟商三日内交出全数鸦片，并签切结书，声明以后不贩鸦片，保证:"嗣后来船永不敢夹带鸦片，如有带来，一经查出，货尽没官，人即正法，情甘服罪。" 少数的烟商屈服，交出
        鸦片，但大部分的烟商，包括官府差役、胥吏查办，皆无所动。 林则徐便宣告:"若鸦片一日未绝，本大臣一日不回，誓与此事相始终，断无中止之理。"林则徐不假差役胥吏之手，知知识界的士人与他同一阵
        线，召粤秀书院、越华书院、羊城书院三大书院六百四十五学子入贡院"考试"。这次名为考试，实为问卷调查，试题四道:鸦片集散地及经营者姓名;零售商;过去禁烟弊端;禁绝之法。自此林则徐掌握了所有烟
        商、贪官污吏之名单。禁烟期间，林则徐写了一封致维多利亚女王的照会，质问女王明知鸦片有害，在国土上包括伦敦、苏格兰和爱尔兰等地不产鸦片，严禁国民吸食(注:实际上英国严禁鸦片吸食要到1912年
        的鸦片公约通过才实行)。但却在其管辖的印度种植生产鸦片，批准国民在中国进行鸦片贸易。他要求女王去除印度的鸦片，并通知女王中国已经通过《钦定严禁鸦片烟条例》，全面禁烟，使英国国民放弃鸦 
        片贸易。
        外国烟商认为交少量鸦片给林则徐交差便了事，于是采取拖延手法，称对命令要详加考虑，成立委员会作报告，七日内回复。 林则徐非常气愤，限令烟商依时交出鸦片，否则翌日十时亲到十三行审判外国烟 
        商。美国烟商表示愿随林则徐指示，遭兰士禄·颠地阻止。结果三日之后，烟商决定象征性交出一千零三十七箱鸦片。 于是邓廷桢下令封锁广州海岸，围困十三行，兰士禄·颠地意图逃走，被邓廷桢活捉。其 
        时商务总监为查理·义律，他一听到十三行被围困，立即从澳门赶到广州。义律只见十三行皆有人把守，便提剑闯入，看守人只得放行，但绝不让他走出来。林则徐下令十三行内所有华人迁出，断绝通信，断 
        水断粮。十三行内有350名外国人，只得亲自去烹调、洗涤、铺床、擦灯、挑水、挤牛奶，做平时根本不用动手做的家务，极大的挫伤了外国烟商的嚣张气焰。`
      }
    ]
  },
  {
    key: "jiaoYan",
    period: "缴烟",
    stories: [
      {
        key: 'jiaoYan1',
        time: '1839年3月',
        location: '广州',
        locationKey: ["guangZhou"],
        detail: `林则徐向查理·义律做出了最后通牒--《示谕外商速交鸦片烟土四条稿》，痛斥查理·义律。查理·义律最终于二月十四(1839年3月28日)早上六时服从林则徐的命令。并向林则徐呈送了《义律遵谕呈 
        单缴烟20283箱禀》；从林则徐3月10日到达广州，到查理·义律3月28日被迫同意缴出全部鸦片，总共18天。不过查理·义律留有后著，他不让外国烟商直接交鸦片给林则徐，而是先交给他，再以"以不列颠女王
        陛下政府的名义"缴出鸦片，连利息、运费一共20238箱鸦片。他邪恶地令普通的商业冲突变相成中英两国的冲突。后来封锁十三行事件后被写入《南京条约》，英国并以此为借口向中国索取了赔款600万银元 
        。《南京条约》写道：“四、因大清钦差大宪等于道光十九年二月间经将大英国领事官及民人等强留粤省，吓以死罪，索出鸦片以为赎命，今大皇帝准以洋银六百万银元偿补原价。”
        三月十九(1839年5月12日)，民间缴烟完毕，拘捕吸毒者、烟贩一千六百人，收缴烟膏四十六万一千五百二十六两、烟枪四万二千七百四十一杆、烟锅二百一十二口。四月初六(1839年5月18日)，烟贩缴烟完毕
        ，共收一万九千一百八十七箱又二千一百十九袋。四月十一(1839年5月23日)，兰士禄·颠地等英国商贩被驱逐出境，次日查理·义律亦将十三行的英国人撤到澳门。`
      }
    ]
  },
  {
    key: "xiaoYan",
    period: "销烟",
    stories: [
      {
        key: 'xiaoYan1',
        time: '1839年6月',
        location: '虎门（现广东东莞）',
        locationKey: ["dongGuan"],
        detail: `道光十九年四月廿二(1839年6月3日)，虎门销烟正式开始，虎门搭起了一座礼台，前面挂著一面黄绫长幡，上书"钦差大臣奉旨查办广东海口事务大臣节制水陆各营总督部堂林"，广东各高级官员全 
        部出席。由于销烟是公开参观的，加上是端午节前后，因此人们纷纷前往虎门浅滩。另外，不贩鸦片的外商、领事、外国记者、传教士等等，都专程由澳门或其他地方前来参观，当中无一是英国人，以抗议清
        廷对英国人财产施加压迫。当中有带同家眷之不贩鸦片的美商C·W·金、传教士裨治文、商船船长弁逊等十人，不信林则徐有办法把所有鸦片完整销毁，于是前来实地考证。林则徐干脆给他们进入池边，让外国
        观察员直接详看销烟方法，沿途讲解。待观看全部过程、反复考察后，皆心悦诚服，向林则徐脱帽致敬。 事后，传教士裨治文在任职的《中国丛报》中记述:"我们已经反复检查销毁过程的一部分，他们在整 
        个工作进行时的细心和忠实的程度，远远超过我们的预料，我不能想象再有任何事情会比执行这项任务更加忠实的了。"此外，《澳门月报》、《季度评论》、《新加坡自由新闻》、《广州纪时报》等外国人 
        报纸皆大编幅连续报道虎门销烟，而且得到与鸦片贸易无关的外国人支持及肯定。英国本土方面也因此事件而物价增涨，尤其是大米、丝绸和银。澳葡政府亦对查禁鸦片一事相当合作，葡萄牙商人全部承诺不
        贩鸦片，并欢迎林则徐亲临查办。林则徐于是发表声明，不但葡萄牙商人可以正常贸易，往中国贸易时更会得到保护，绝不被人欺凌。 1839年6月3日，林则徐在虎门海滩当众销毁鸦片，23天共销毁鸦片19187箱和2119袋，总重量2376254斤，遏制了鸦片在中国的泛滥。`
      }
    ]
  },
  {
    key: "zhiLiShuiLi",
    period: "治理水利",
    stories: [
      {
        key: 'zhiLiShuiLi1',
        time: '1831年12月',
        location: '山东、河南',
        locationKey: ["shanDong", "heNan"],
        detail: `道光十一年十一月廿二（1831年12月25日），林则徐擢升东河河道总督。到任后，林则徐立即补修治水方面的知识，验催河工，保持质量，处分办事不力之官员，下令检验河堤料垛，他向道光帝呈 
        上的奏折中表示：“周历履勘，总于每垛夹档之中，逐一穿行，量其高宽丈尺，相其新旧虚实，有松即抽，有疑即拆，按垛以计束，按束以称斤，无一垛不量，亦无一厅不拆。”林则徐做事如此认真，令贪官无
        可作假，桃汛来时，两岸安然无恙，道光帝多次称赞。当林则徐的对治水方面的知识和经验日丰，诗人张际亮向林则徐提议将黄河河道改道北流，从山东利津入海。林则徐也有同感，但民意和官员都反对此治
        河方略，加上林则徐不能独揽全局，张际亮之提议遭否决。直到林则徐逝世前不久，还表示张际亮的治河方略是对的。林则徐逝世后，咸丰五年（1855年），黄河改道，循大清河至利津入海。`
      }
    ]
  },
  {
    key: "hengZaoWuXian",
    period: "横遭诬陷",
    stories: [
      {
        key: 'hengZaoWuXian1',
        time: '1840年',
        location: '广州',
        locationKey: ["guangZhou"],
        detail: `道光二十年（1840年）6月，英军派舰队封锁珠江口，进攻广州。林则徐严密布防，使英军的进攻未能得逞。英军受阻后沿海岸北上，于7月5日攻占定海，8月9日抵达天津大沽口，威胁北京。这时，
        道光帝惊慌失措，急令直隶总督琦善前去“议和”；又命令两江总督伊里布查清英军攻占定海的原因，究竟是由于“绝其贸易”还是“烧其鸦片”，意欲将林则徐作为“替罪羊”。从此，各种诬陷、打击和指责连续降
        临到林则徐的头上。琦善是妥协派的骨干，当然不会错过这一陷害和打击林则徐的机会。他声称英国所不满的只是林则徐一人，只要清廷惩治林则徐，所有问题都可解决。其间，林则徐两次上奏，大胆陈述禁
        烟抗英的合理性和正义性。道光帝翻脸，指责林则徐简直是一派胡言。道光二十年9月29日，道光帝下旨，革了林则徐的职，并命令“交部严加议处，来京听候部议。”10月25日，林则徐又收到吏部文件，通知 
        他暂留广州，等待新任钦差大臣博尔济吉特·琦善的审问和发落。`
      },
      {
        key: 'hengZaoWuXian2',
        time: '1841年5月',
        location: '浙江',
        locationKey: ["zheJiang"],
        detail: `道光二十一年（1841年）5月1日，林则徐又接到圣旨：降为四品卿衔，速赴浙江镇海听候谕旨。到镇海后，林则徐积极参与了当地的海防建设事宜，力图“戴罪立功”。不久，接替琦善的靖逆将军奕 
        山在率军与英军作战中打了败仗。为了开脱罪责，他竟造谣说，英方是愿意议和的，他们恨之入骨的只有林则徐一人。言外之意，就是必须再次惩办林则徐，英方才能罢兵议和。道光帝求和心切，便把广州战
        败的责任再次归罪于林则徐，说他在广州任职时没有积极筹划防务，以致英军发起进攻后，奕山招架不住。`
      },
      {
        key: 'hengZaoWuXian3',
        time: '1841年6月',
        location: '新疆伊犁',
        locationKey: ["xinJiangYiLi"],
        detail: `道光皇帝下旨，革去林则徐“四品卿衔”，“从重发往新疆伊犁，效力赎罪。” 林则徐抗英有功，却遭投降派诬陷，被道光帝革职，他忍辱负重，道光二十一年（1841年7月14日）踏上戍途。在赴戍途 
        中，仍忧国忧民，并不为个人的坎坷而唏嘘，当与妻子在古城西安告别时，在满腔愤怒下写了“苟利国家生死以，岂因祸福避趋之”的激励诗句。这是他爱国情感的抒发，也是他性情人格的写照。林则徐不顾年
        高体衰，从伊犁到新疆各地“西域遍行三万里”，实地勘察了南疆八个城，加深了对西北边防重要性的认识。林则徐所译资料中发现沙俄对中国的威胁，促成了他抗英防俄的国防思想，成为近代“防塞论”的先驱
        。于是他明确向伊犁将军布彦泰提出“屯田耕战”，有备无患。他还领导群众兴修水利，推广坎儿井和纺车，人们为纪念他的业绩，称为“林公井”、“林公车”。林则徐根据自己多年在新疆的考察，结合当时沙俄
        胁迫清廷开放伊犁，指出沙俄威胁的严重性，临终时曾大声疾呼，告诫国人：“终为中国患者，其俄罗斯乎！吾老矣，君等当见之。”果不其然，六十余年之后，数百万领土已被蚕食鲸吞，历史证明了林则徐是
        正确的！`
      }
    ]
  },
  {
    key: "chongShouZhongYong",
    period: "重受重用",
    stories: [
      {
        key: 'chongShouZhongYong1',
        time: '1845年',
        location: '陕西, 甘肃',
        locationKey: ["shanXi", "ganSu"],
        detail: `道光二十五年（1845年）开始，朝廷重新起用林则徐，调任陕甘总督、陕西巡抚、云贵总督。道光二十五年九月奉召回京候补，十一月以三品顶戴署理陕甘总督。二十六年（1846年）四月，授陕西 
        巡抚，七月初九（8月30日）抵陕上任。这时的陕西，各种社会矛盾十分尖锐：鸦片战争时，清廷为解决军费困难，除调拨陕西征收的盐税外，还强令陕西捐银一百多万两；鸦片战争后给外国侵略者的赔款也 
        摊派到陕西，仅西安府咸宁、长安两县的赔款银，年征收就在二万两以上，相当于上缴正银数的三分之一；加上各地接连发生灾荒，劳苦群众生活异常艰难；渭南、富平、三原、大荔、蒲城等地的“刀客”与当
        地回民联合起来，反抗官府的斗争此起彼伏。`
      }
    ]
  },
  {
    key: "bingZhongShiShi",
    period: "病重逝世",
    stories: [
      {
        key: 'bingZhongShiShi1',
        time: '1847年3月',
        location: '云南',
        locationKey: ["yunNan"],
        detail: `道光二十七年（1847年）三月，清廷命林则徐为云贵总督。到任后，以维护云南边境安定得力加太子太保，赏戴花翎。`
      },
      {
        key: 'bingZhongShiShi2',
        time: '1849年9月',
        location: '广西',
        locationKey: ["guangXi"],
        detail: `二十九年（1849年）秋，因病重奏请开缺回乡调治，翌年三月返抵侯官。九月，又被清廷命为钦差大臣，去广西镇压拜上帝会的反清武装起义。他抱病从侯官起程`
      },
      {
        key: 'bingZhongShiShi3',
        time: '1850年11月22日',
        location: '广东潮州',
        locationKey: ["chaoZhou"],
        detail: `他抱病从侯官起程，十月十九日（1850年11月22日）逝于潮州普宁行馆。到潮州时，开始严重下痢，到了普宁，已病入膏肓，不得不暂住普宁行馆。最后林则徐在儿子林聪彝及幕僚刘存仁陪同下， 
        于道光三十年十月十九（1850年11月22日）辰时，指天三呼“星斗南”之后，与世长辞，享年六十六岁。死后清廷晋赠其太子太傅，照总督例赐恤，历任一切处分悉行开复，谥文忠。在报丧奏折到京前，清廷于
        十月二十四日（11月27日）还命他暂署广西巡抚。`
      }
    ]
  }
]

window.locations = [{
  locationKey: 'fuJianFuZhou',
  name: "福建福州",
  log: '119.31',// 经度
  lat: '26.05',// 维度
  color: '#bcbe0e',
  stories: ['poorChildhood1', 'youthEnlightenment1', 'zhongjuMarried1']
},
{
  locationKey: "fuJianXiaMen",
  name: "福建厦门",
  log: '118.06',// 经度
  lat: '24.27',// 维度
  color: '#ff0025',
  stories: ['newCareer1', 'newCareer2']
},
{
  locationKey: "beiJing",
  name: "北京",
  log: '116.24',// 经度
  lat: '39.55',// 维度
  color: '#ff9493',
  stories: ['newCareer3', 'renShuJiShi1']
},
{
  locationKey: "heNan",
  name: "河南",
  lat: '34.46',// 经度
  log: '113.40',// 维度
  color: '#4ca731',
  stories: ['fenErBaGuan1', 'fuZhiGuanChang3', 'zhiLiShuiLi1']
},
{
  locationKey: "jiangSu",
  name: "江苏",
  lat: '32.03',
  log: '118.46',
  color: '#ffbc6b',
  stories: ['fuZhiGuanChang1', 'fuZhiGuanChang4', 'fuZhiGuanChang3']
},
{
  locationKey: "shanXi",
  name: "陕西",
  lat: '34.17',
  log: '108.57',
  color: '#a44ba0',
  stories: ['fuZhiGuanChang2', 'chongShouZhongYong1']
},
{
  locationKey: "heBei",
  name: "湖北",
  lat: '30.35',// 维度
  log: '114.17',// 经度
  color: '#30c4a7',
  stories: ['fuZhiGuanChang3']
},
{
  locationKey: "guangDong",
  name: "广东",
  lat: '23.13',// 维度
  log: '112',// 经度
  color: '#fd0000',
  stories: ['jinZhiYaPian1']
},
{
  locationKey: "guangZhou",
  name: "广州",
  lat: '23.13',// 维度
  log: '113.27',// 经度
  color: '#fd0000',
  stories: ['jiaoYan1', 'hengZaoWuXian1']
},
{
  locationKey: "dongGuan",
  name: "东莞",
  lat: '23.05',// 维度
  log: '114.00',// 经度
  color: '#ff7600',
  stories: ['xiaoYan1']
},
{
  locationKey: "shanDong",
  name: "山东",
  lat: '36.67',// 维度
  log: '116.98',// 经度
  color: '#ceb0d5',
  stories: ['zhiLiShuiLi1']
},
{
  locationKey: "zheJiang",
  name: "浙江",
  lat: '30.28',// 维度
  log: '120.15',// 经度
  color: '#ffff9a',
  stories: ['hengZaoWuXian2']
},
{
  locationKey: "xinJiangYiLi",
  name: "新疆伊犁",
  lat: '43.92',// 维度
  log: '81.32',// 经度
  color: '#c15423',
  stories: ['hengZaoWuXian3']
},
{
  locationKey: "ganSu",
  name: "甘肃",
  lat: '36.07',// 维度
  log: '103.82',// 经度
  color: '#c1add3',
  stories: ['chongShouZhongYong1']
},
{
  locationKey: "yunNan",
  name: "云南",
  lat: '25.05',// 维度
  log: '102.72',// 经度
  color: '#60cb83',
  stories: ['bingZhongShiShi1']
},
{
  locationKey: "guangXi",
  name: "广西",
  lat: '22.82',// 维度
  log: '108.37',// 经度
  color: '#e3f6ca',
  stories: ['bingZhongShiShi2']
},
{
  locationKey: "chaoZhou",
  name: "广东潮州",
  lat: '23.68',// 维度
  log: '116.63',// 经度
  color: '#e3f6ca',
  stories: ['bingZhongShiShi3']
}
]