var lifePath = [
  {
    title: "早年生活",
    sub: [
      {
        title: "人质之子",
        loc: "河北邯郸",
        coord:[
          114.50088500976561,
          36.586863023441836
        ],
        time: "前259年12月",
        detail: `嬴政在秦昭王四十八年正月生于邯郸, 父亲是秦公子异人(有一说其真实生父为吕不韦),
        母亲是赵姬. 由于秦昭襄王采用范雎的\"远交近攻\"战略, 异人被遣往赵国作为人质. 当时异人
        兄弟众多, 他难以继承王位. 但在吕不韦认为他\"奇货可居\", 亲自游说秦王后的弟弟使得王后
        同意将异人接回秦国立为太子, 来弥补自己无子的短处稳固自己将来的权势地位.`
      },
      {
        title: "返秦回乡",
        loc: "陕西咸阳",
        coord:[
          108.72482299804688,
          34.309412579370544
        ],
        time: "前246年",
        detail: `在吕不韦的帮助下, 赵王出于取得未来秦王的友谊的目的同意异人回国. 异人返秦后得
        到王后和秦孝文王的欣赏并进一步得以被立为太子, 继任秦王, 称秦庄襄王. 但在位三年后驾崩,
        时年13岁的嬴政因而正式坐上秦王的宝座.`
      }
    ]
  },
  {
    title: "即位初期",
    sub: [
      {
        title: "秦内形势",
        loc: "陕西咸阳",
        coord:[
          108.72482299804688,
          34.309412579370544
        ],
        time: "前246年",
        detail: `嬴政即位初期由于年龄尚幼, 尊相国吕不韦为仲父主持国政. 吕不韦看自己地位巩固,
        又年秦国国力强盛, 招徕天下贤士, 门下食客一度达到三千之数. 吕不韦更是授意食客编史, 成书
        吕氏春秋. 据日本就实大学综合历史学系李開元教授的分析, 当时秦国国政完全掌握在三大外戚派
        系手中, 分别是: 嬴政养祖母华阳夫人的楚系, 嬴政亲祖母夏姬和韩系, 和嬴政生母赵姬的赵系.
        而嬴政本人权力地位相对薄弱, 国内吕不韦一手遮天, 秦内形势相当严峻.`
      },
      {
        title: "成蟜叛变",
        loc: "山西屯留",
        coord:[
          112.88177490234375,
          36.32508354600387
        ],
        time: "前239年",
        detail: `成蟜为嬴政同父弟弟, 生母可能是韩系族人. 前239年, 嬴政命成蟜率军攻打赵国,
        成蟜在山西省屯留县降赵. 秦军攻占屯留后成蟜部下皆连坐处死, 成蟜逃往赵国, 被赵悼襄王封
        于饶(今河北省饶阳县东北). 成蟜叛秦一事现在仍有争议, 一说是由于夏姬于前240年去世, 嫪毐
        受赵姬意意图清洗韩系势力. 也有一说认为成蟜没有动机放弃长安封地而叛国受封于饶, 事实上是
        染病死于军营而叛秦作乱者另有他人.`
      },
      {
        title: "嫪毐之乱",
        loc: "陕西凤翔",
        coord:[107.4113, 34.5521],
        time: "前238年",
        detail: `吕不韦与赵姬一直保持着不伦关系, 嬴政年龄渐长吕不韦怕事情败露, 暗地寻觅一阳具
        奇大的奇人嫪毐, 在宴会上表演阳具使桐木车轮转动, 故意将此事传入太后赵姬耳中. 而后嫪毐被
        假施腐刑同太后淫乱, 为避人耳目二人迁往秦旧都雍(今陕西凤翔县南). 前238年事情败露嬴政着
        手彻查, 嫪毐孤注一掷假拟印信发动政变, 后被平, 嫪毐生擒送至咸阳, 处以车裂之刑, 夷三族.
        赵姬被接回咸阳得以善终. 一说是顾及孝道, 但也有学者认为是为了平衡赵系和楚系外戚势力.`
      },
      {
        title: "吕氏之死",
        loc: "河南洛阳",
        coord:[112.0538, 34.3209],
        time: "前235年",
        detail: `嫪毐叛乱牵连到了相国吕不韦, 但由于忌惮吕不韦的势力, 前237年, 嬴政只好先罢免
        他的职务, 并把吕不韦放逐到他的领地, 也是如今的河南省. 但一年过后, 吕不韦依然声名显赫影
        响力惊人, 嬴政害怕吕不韦发动叛乱, 于前235年向他赐下敕书, 诏他迁族人往属地. 吕不韦感到
        嬴政不会善罢甘休, 敕书也是暗示他自裁. 唯有服毒自杀. 死后门客偷偷将他葬在洛邑北邙山. 吕
        不韦身死, 秦内形势彻底稳定, 嬴政大权在手, 中央集权达到高峰. 成为了名副其实的秦君.`
      }
    ]
  },
  {
    title: "统一六国",
    sub:[
      {
        title: "削弱赵国",
        loc:"河北磁县",
        coord:[
          114.38415527343749,
          36.36822190085111
        ],
        time: "前234年",
        detail: `从前236年开始, 赵将庞煖领兵攻燕, 试图胁迫燕国共同抗秦. 嬴政趁次机会以援助
        燕国为由命王翦、桓齮、杨端和攻打赵国. 到前234年, 秦军再度进攻赵国的平阳（今河北磁县东
        南）、武城（磁县西南）,斩首10万,大败赵军,并杀死赵将扈辙.赵国经受这次攻击后国力大衰
        仅能退守邯郸自保. 虽然之后调名将李牧击退秦军收复失地, 可是已经无力援助韩国攻打秦国了.`
      },
      {
        title:"歼灭韩国",
        loc:"河南禹州",
        coord:[
          113.46748352050781,
          34.158977272273354
        ],
        time:"前230年",
        detail:`趁着赵国国力衰微, 以及当年赵国境内发生大地震和饥荒, 再无力援助韩国, 嬴政发兵
        攻韩. 擒获韩王安, 韩国灭亡. 将韩国设置为颍川郡. 建郡治于阳翟(今河南禹州). 但嬴政下令
        将“天下不轨之民”赶往南阳的举措, 引起了韩国故地局势不稳, 秦国一度陷入新郑骚乱及李信之败
        的窘境.`
      },
      {
        title:"歼灭赵国",
        loc:"河北邯郸",
        coord:[
          114.50088500976561,
          36.586863023441836
        ],
        time:"前228年",
        detail:`公元前228年（秦王政十九年）,秦国王翦军破赵军,杀赵葱,俘颜聚,佔邯郸,赵王迁
        被俘虏,赵国灭亡.赵公子嘉在邯郸被攻佔后,率领他的宗族几百人到代地（今河北蔚县东北）收
        拾残部,并自立为代王,向东与燕国的军队会合.至于秦军则暂停军事行动,驻扎在中山,做好攻
        打燕国的准备.王翦攻佔邯郸后,嬴政亲自到邯郸,找到当初与他在赵国时,与赵姬有仇的人,把他
        们全部活埋,其后经太原、上郡返回都城咸阳. `
      },
      {
        title:"歼灭魏国",
        loc:"河南开封",
        coord:[
          114.36492919921875,
          34.79801697349404
        ],
        time:"前225年",
        detail:`早在秦王政16年韩国献南阳地的时候,迫于秦国强大的军力,魏国亦主动向秦国献地求和
        ,秦国在该地设置丽邑. 此时嬴政正调集主力全力攻赵,不想分散兵力攻魏,就接受了献地,使魏国苟延
        残喘. 公元前226年, 嬴政藉口楚王背弃献出青阳（今湖南长沙）以西土地的承诺,并袭击秦国南郡
        为理由,派王贲率大军出函谷关,攻佔了楚国北部的十几座城.在保障了攻魏秦军侧翼安全后,王贲旋
        即回军北上突袭并围困住魏国国都大梁（今河南省开封市西北）.大梁居于睢水、颍水、鸿沟的交汇
        之地,护城河十分辽阔,五座城门皆备吊桥,地形易守难攻.魏军依託大梁的城防工事死守,秦军强攻
        毫无奏效,王贲竟引黄河、鸿沟（汴渠）水灌入城内. 公元前225年 ,大梁城被水浸近三个月,城牆
        崩坏,魏王假投降,魏国灭亡.嬴政在魏国地区设立砀郡,又建置泗水郡.`
      },
      {
        title:"歼灭楚国",
        loc:"安徽宿州",
        coord:[
          116.971435546875,
          33.62605502663528
        ],
        time:"前223年",
        detail:`公元前225年嬴政遣李信攻楚, 由于昌平君叛变兵败. 嬴政只好亲自前往频阳, 登门造
        访被贬斥出京、还乡养老的王翦, 強行徵召王翦攻楚. 王翦担心自己重蹈武安君白起覆辙, 只能领
        兵攻楚. 公元前224年, 王翦率领六十万大军沿着之前李信攻楚的行军路线, 直扑郢陈. 但仍然直
        到前223年才攻破郢陈. 宣告楚国灭亡.`
      },
      {
        title:"歼灭燕国",
        loc:"辽宁辽河",
        coord:[
          123.57971191406249,
          41.80817277478235
        ],
        time:"前222年",
        detail:`嬴政因为燕太子丹遣荆轲刺秦而大发雷霆,于公元前227年命令王翦、辛胜的军队跨过易
        水,大败燕、代两军于易水之西.其后一年,秦军攻陷燕国都城蓟.燕王喜、太子丹、代王嘉等人
        率部队东退退守辽东. 秦将李信紧紧追击燕王与太子丹,太子丹隐藏在衍水河中,代王嘉则建议燕
        王喜杀掉太子丹,以求嬴政的宽恕. 燕王喜接纳代王嘉的建议,派使者杀了太子丹,把他的人头献
        给嬴政.当时秦军主力几乎调往南线进攻楚国,燕王喜、代王嘉两人得以在辽东苟延残喘.直到前
        222年, 王贲奉嬴政之命,扫除燕国在辽东的残余势力,俘虏了燕王喜及代王嘉,燕国彻底灭亡.`
      },
      {
        title:"歼灭齐国",
        loc:"山东淄博",
        coord:[
          118.00689697265625,
          36.798288873837045
        ],
        time:"前221年",
        detail:`秦国灭五国后,齐王建才顿感秦国的威胁,慌忙将军队集结到西部边境,并断绝和秦国的
        来往,但为时已晚.公元前221年,嬴政以齐国拒绝秦使者访齐为由,命王贲在灭燕之后率军南下攻
        齐,秦军避开了齐军西部主力,由燕国南部南下,一路势如破竹,几乎没有抵抗,大军直抵齐都临淄
        (今山东淄博北),齐军措手不及.齐王建听从后胜的建议,不战而降,后被迁到共城.秦军攻入临
        淄后,百姓居然没人敢反抗.不过事后齐国百姓反而埋怨齐王建不早与诸侯合纵攻秦,仅对秦国言听
        计从,以致亡国,讽刺道：“松耶柏耶?住建共者客耶?”`
      }
    ]
  },
  {
    title: "统一之后",
    sub:[
      {
        title:"经济政治",
        loc:"陕西咸阳",
        coord:[
          108.72482299804688,
          34.309412579370544
        ],
        time:"前220年",
        detail:`完成统一六国霸业之后, 嬴政在国家政治经济层面进行了更进一步的统一. 包括自称始
        皇帝, 全域推行崇尚法家的秦制, 采用郡县制度强化中央集权, 收集天下兵器在咸阳铸成十二铜人
        以防止六国遗民作乱, 兴建水利工程, 修建驰道, 统一文字, 货币, 度量衡, 修建驰道. 史称“车
        同轨, 书同文”`
      },
      {
        title:"修建长城",
        loc:"万里长城",
        coord:[110.314, 41.6],
        time:"前214年",
        detail:`公元前214年, 秦始皇派将军蒙恬率领三十万人攻击匈奴, 占据河套. 为了抵御北方游
        牧民族的侵略, 秦始皇下令将秦赵燕三国修筑的旧城牆连接起来, 从临洮到辽东绵延万里, 成为“万
        里长城”的前身. 在修筑北方长城的同时, 原诸侯国用以“互防”的城墙被拆毁. 之后在历朝历代的
        复建和修缮下, 著名的长城成为了抵御北方匈奴入侵的重要军事建筑.`
      },
      {
        title:"始皇之死",
        loc:"河北邢台",
        coord:[
          114.48440551757811,
          37.05956083025126
        ],
        time:"前210年",
        detail:`前210年, 秦始皇第五次全国巡游以向六国显示威严巩固统治. 赵高胡亥同行. 秦始皇
        在抵逹黄河下游的平原津（今山东省德州市平原县）时，突发重病倒下. 重病不治, 不久后在沙丘
        平台（今河北省邢台市广宗县）逝世. `
      }
    ]
  }
];

var lifeBarData = [
  {
    "name": "齐",
    "life": -221
  },
  {
    "name": "楚",
    "life": -223
  },
  {
    "name": "燕",
    "life": -222
  },
  {
    "name": "韩",
    "life": -229
  },
  {
    "name": "赵",
    "life": -228
  },
  {
    "name": "魏",
    "life": -225
  },
  {
    "name": "秦",
    "life": -207
  }
]
